app/Http/Controllers/AdminPostController.php

    public function index() {
        return view('admin.posts.index', [
            'posts' => Post::paginate(50)
        ]);
---
SELECT * FROM `posts` LIMIT 50 offset 0
SELECT count(*) as aggregate FROM `posts`

    public function update(Post $post) {
        $attributes = $this->validatePost($post);

        if(isset($attributes['thumbnail'])) {
            $attributes['thumbnail'] = request()->file('thumbnail')->store('thumbnails');
        }

        $post->update($attributes);
---
UPDATE `posts` SET `title` = 'Changed Hello this IS title change2', `posts`.`updated_at` = '2023-03-31 18:55:21' WHERE `id` = 6

    public function destroy(Post $post) {
        $post->delete();
---
DELETE FROM `posts` WHERE `id` = 2