app/Http/Controllers/PostCommentsController.php

    public function store(Post $post) {
        request()->validate([
            'body' => ['required']
        ]);

        $post->comments()->create([
            'user_id' => request()->user()->id,
            'body' => request('body')
        ]);
---
INSERT INTO `comments` (`user_id`, `body`, `post_id`, `updated_at`, `created_at`) VALUES (2, 'hello', 6, '2023-03-31 13:15:03', '2023-03-31 13:15:03')