app/Http/Controllers/PostController.php

SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3, 4, 5)
SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 6 offset 0
SELECT count(*) as aggregate FROM `posts`
---
    public function index() {
        return view('posts.index', [
            'posts' => Post::latest()->filter(
                request(['search', 'category', 'author'])
            )->paginate(6)->withQueryString()
        ]);

SELECT * FROM `categories` WHERE `slug` = 'sint-molestias-officia-commodi' LIMIT 1
SELECT * FROM `posts` WHERE (`title` like '%minima%' or `body` like '%minima%') ORDER BY `created_at` DESC
---
    public function store() {
        $attributes = request()->validate([
            'title' => ['required'],
            'thumbnail' => ['required', 'image'],
            'slug' => ['required', Rule::unique('posts', 'slug')],
            'excerpt' => ['required'],
            'body' => ['required'],
            'category_id' => ['required', Rule::exists('categories', 'id')]
        ]);