app/Http/Controllers/RegisterController.php

    public function store() {
        $attributes = request()->validate([
            'name' => ['required', 'max:255', 'min:2'],
            'username' => ['required', 'max:255', 'min:3'],
            'email' => ['required', 'email','max:255'],
            'password' => ['required', 'max:255', 'min:7']
        ]);

        User::create($attributes);
---
INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('dawdwadwa', 'dwadwadwad', 'luka@mail.ru', 'dawdwadwadwa', '2023-03-29 18:03:31', '2023-03-29 18:03:31')